Conf.Simple/src/InformationRegisters/SUI_ОчередьЗаданий/SUI_ОчередьЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ОчередьЗаданий</name>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.SUI_СтатусыОбработкиОчередиЗаданий</types>
    </type>
  </resources>
  <resources>
    <name>Обработчики</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторЗадания</name>
    <comment>Идентификатор фонового задания</comment>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ОбработчикЗавершения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВнеОчереди</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Создано</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Обновлено</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Сеанс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОписаниеРезультата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Хеш</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_ОчередьЗаданий/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьЖурналРегистрации(Команда)

	Перем Сеанс, НачальнаяДата, КонечнаяДата;

	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		Сеанс = Элементы.Список.ТекущиеДанные.Сеанс;
		НачальнаяДата = Элементы.Список.ТекущиеДанные.Создано - 60;
		Если ЗначениеЗаполнено(Элементы.Список.ТекущиеДанные.Обновлено) Тогда
			КонечнаяДата = Элементы.Список.ТекущиеДанные.Обновлено + 60;
		КонецЕсли;
	КонецЕсли;
	
	SUI_ЖурналРегистрацииКлиент.ОткрытьЖурналРегистрации(
		SUI_ОчередьЗаданийКлиентСервер.ПараметрыОткрытияЖурналаРегистрации(Сеанс, , НачальнаяДата, КонечнаяДата), ЭтотОбъект);
		
КонецПроцедуры

#КонецОбласти
